content/topics/house_music.md
+++
title = "House music"
author = ["hermes"]
tags = ["music"]
draft = false
+++

## Overview {#overview}

House music is a genre of electronic dance music originating in Chicago in the early 1980s, rooted in disco, soul, and gospel. Deep house and soulful house draw heavily on the Chicago tradition (Larry Heard, early Trax Records). Signature characteristics: chromatic, soulful melodies; syncopated bass lines; four-on-the-floor kick drum. Typical production tempo range is 122–124 BPM.


## Subgenres {#subgenres}

-   **Deep house** — slower, more atmospheric, jazz and soul-influenced; Larry Heard ("Mr. Fingers") is the canonical reference.
-   **Soulful house** — vocal-driven, gospel-inflected; emphasises emotional arc and resolution.
-   **Minimal house** — stripped-back; rhythmic variation over harmonic complexity; pedal-tone bass lines.


## Melody approaches {#melody-approaches}

-   Chromatic lines: stepwise movement including semitones outside the diatonic scale gives tension and introspection (characteristic of F minor / dark tracks).
-   Modal lines: melodies built on modes such as [Dorian mode]({{< relref "dorian_mode.md" >}}) introduce a characteristic colour — the raised 6th of Dorian gives a soulful, hopeful quality.
-   Diatonic release: resolving to the major home key (e.g. Ab major) produces the euphoric "peak" feel of a set's climax.


## Bass line techniques {#bass-line-techniques}

Four main approaches in house production:

1.  **Melody mirror** — double the melody an octave or two lower in the sub register; pitch-bend slides add expressiveness.
2.  **Root + fifth pump** (classic house) — alternates root and fifth (e.g. F → C → F → C), syncopated on the "and" of beats 2 and 4 to lock with the kick.
3.  **Walking chromatic line** (deep house) — stepwise semitone movement, e.g. F → F# → G# → A → Bb; associated with Larry Heard; creates strong forward momentum.
4.  **Pedal tone with rhythm** (minimal house) — sustain a low root note (F or Bb) and vary the rhythm (16th-note stabs) rather than the pitch.

The signature house bass rhythm in 4/4 lands a syncopated accent on the "and of 2."


## Harmonic structure in a 3-track set {#harmonic-structure-in-a-3-track-set}

A set unified around the key signature of 4 flats (Bb, Eb, Ab, Db) illustrates how all three tracks can share a diatonic chord pool while following an emotional arc of tension → opening → release:

-   Track 1 — F minor (chromatic): melody F, F#, G#. Dark, tense, introspective. Fm is the relative minor of Ab major.
-   Track 2 — Bb Dorian: melody Bb, C, Eb, F. Soulful, hopeful. Bb Dorian is the Ab major scale starting on Bb; its characteristic move is i → IV (Bbm → Eb).
-   Track 3 — Ab major: melody Ab, Bb, C, Eb. Bright, euphoric, release. The G#/Ab that was a chromatic tension note in Track 1 becomes the root — closing the loop.

The G# enharmonic pivot (chromatic dissonance in Track 1 → tonal root in Track 3) is a key compositional device.

See also: [Circle of fifths]({{< relref "circle_of_fifths.md" >}}), [Harmonic mixing]({{< relref "harmonic_mixing.md" >}}), [DJ set arc]({{< relref "dj_set_arc.md" >}}).


## Resources {#resources}

-   2026-06-07 ◦ [House Music: Melody, Bass Lines, and Harmony](~/repos/priv/roam-sources/articles/2026/2026-06-07_house-music-theory-melody-bass-harmony.md) — synthesized notes on composing a 3-track deep/soulful house set, covering genre context, bass line approaches, harmonic structure, and circle-of-fifths chord derivation
